xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_uart.h
/** @defgroup UART_Stop_Bits UART Number of Stop Bits
  * @{
  */
#define UART_STOPBITS_1                     0x00000000U
#define UART_STOPBITS_1_5_OR_2              ((uint32_t)UART_CR1_STOP)
/**
  * @}
  */

/** @defgroup UART_Parity UART Parity
  * @{
  */
#define UART_PARITY_NONE         0x00000000U
#define UART_PARITY_EVEN         ((uint32_t)(UART_CR1_PCE | UART_CR1_PS))
#define UART_PARITY_ODD          ((uint32_t)UART_CR1_PCE)
#define UART_PARITY_STICKY_0     ((uint32_t)(UART_CR1_PCE | UART_CR1_SP | UART_CR1_PS))
#define UART_PARITY_STICKY_1     ((uint32_t)(UART_CR1_PCE | UART_CR1_SP))
/**
  * @}
  */

/** @defgroup UART_Msb_First UART MSB First
  * @{
  */
#define UART_MSB_FIRST_DISABLE         0x00000000U
#define UART_MSB_FIRST_ENABLE          ((uint32_t)UART_CR1_MSBFIRST)
/**
  * @}
  */
  
/** @defgroup UART_Tx_Mode UART transmit mode
  * @{
  */
#define UART_TX_MODE_0         0x00000000U
#define UART_TX_MODE_1         ((uint32_t)UART_CR3_TX_MODE)
/**
  * @}
  */

/** @defgroup UART_Rx_Mode UART receive mode
  * @{
  */
#define UART_RX_ADDR_MATCH_SOFT         0x00000000U
#define UART_RX_ADDR_MATCH_HARD         ((uint32_t)UART_CR3_ADDR_MATCH)
/**
  * @}
  */

/** @defgroup UART_DMA_Tx    UART DMA Tx
  * @{
  */
#define UART_DMA_TX_DISABLE                 0x00000000U                /*!< UART DMA TX disabled */
#define UART_DMA_TX_ENABLE                  UART_CR3_DMAT              /*!< UART DMA TX enabled  */
/**
  * @}
  */

/** @defgroup UART_DMA_Rx   UART DMA Rx 
  * @{
  */
#define UART_DMA_RX_DISABLE                 0x00000000U                 /*!< UART DMA RX disabled */
#define UART_DMA_RX_ENABLE                  UART_CR3_DMAR               /*!< UART DMA RX enabled  */
/**
  * @}
  */

/** @defgroup UART_Flags   UART FLags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the SR register
  * @{
  */
#define UART_FLAG_BUSY_ERR                  ((uint32_t)UART_SR_BUSY_ERR)
#define UART_FLAG_BUSY                      ((uint32_t)UART_SR_BUSY)
#define UART_FLAG_ADDR_RCVD                 ((uint32_t)UART_SR_ADDR_RCVD)
#define UART_FLAG_TXE                       ((uint32_t)UART_SR_TXE)
#define UART_FLAG_TDRE                      ((uint32_t)UART_SR_TDRE)
#define UART_FLAG_BRI                       ((uint32_t)UART_SR_BRI)
#define UART_FLAG_FE                        ((uint32_t)UART_SR_FE)
#define UART_FLAG_PE                        ((uint32_t)UART_SR_PE)
#define UART_FLAG_ORE                       ((uint32_t)UART_SR_ORE)
#define UART_FLAG_RXNE                      ((uint32_t)UART_SR_RXNE)
/**
  * @}
  */

/** @defgroup UART_Interrupt_definition  UART Interrupt Definitions
  *        Elements values convention: 0xXXXX
  *           - XXXX  : Interrupt mask in the CR2 register
  * @{
  */
#define UART_IT_BUSY_ERR                     ((uint32_t)UART_CR2_BUSYERRIE)
#define UART_IT_LS                           ((uint32_t)UART_CR2_LSIE)
#define UART_IT_TDRE                         ((uint32_t)UART_CR2_TDREIE)
#define UART_IT_RXNE                         ((uint32_t)UART_CR2_RXNEIE)
#define UART_IT_TXE                          ((uint32_t)UART_CR2_TXEIE)
/**
  * @}
  */
  
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup UART_Exported_Macros UART Exported Macros
  * @{
  */

/** @brief Reset UART handle gstate & RxState
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  * @retval None
  */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
#define __HAL_UART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = HAL_UART_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = HAL_UART_STATE_RESET;     \
                                                       (__HANDLE__)->MspInitCallback = NULL;             \
                                                       (__HANDLE__)->MspDeInitCallback = NULL;           \
                                                     } while(0U)
#else
#define __HAL_UART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = HAL_UART_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = HAL_UART_STATE_RESET;     \
                                                     } while(0U)
#endif /*USE_HAL_UART_REGISTER_CALLBACKS */

/** @brief  Flushes the UART DR register
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  */
#define __HAL_UART_FLUSH_DRREGISTER(__HANDLE__) ((__HANDLE__)->Instance->DR)

/** @brief  Checks whether the specified UART flag is set or not.
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg UART_FLAG_BUSY_ERR : When UART is busy (SR [9] is set to 1), the master attempts to write to the CR1 register
  *            @arg UART_FLAG_BUSY     : UART busy flag
  *            @arg UART_FLAG_ADDR_RCVD: Address receiving flag
  *            @arg UART_FLAG_TXE      : Send empty flag
  *            @arg UART_FLAG_TDRE     : Send Hold Register Empty flag
  *            @arg UART_FLAG_BRI      : Break interrupt flag
  *            @arg UART_FLAG_FE       : Framing Error flag
  *            @arg UART_FLAG_PE       : Parity Error flag
  *            @arg UART_FLAG_ORE      : Overrun Error flag
  *            @arg UART_FLAG_RXNE     : Receive data register not empty flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_UART_GET_FLAG(__HANDLE__, __FLAG__) (((__HANDLE__)->Instance->SR & (__FLAG__)) == (__FLAG__))

/** @brief  Clears the specified UART pending flag.
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg UART_FLAG_BUSY_ERR : When UART is busy (SR [9] is set to 1), the master attempts to write to the CR1 register
  *            @arg UART_FLAG_ADDR_RCVD: Address receiving flag
  *            @arg UART_FLAG_BRI      : Break interrupt flag
  *            @arg UART_FLAG_FE       : Framing Error flag
  *            @arg UART_FLAG_PE       : Parity Error flag
  *            @arg UART_FLAG_ORE      : Overrun Error flag
  * @retval None
  */
#define __HAL_UART_CLEAR_FLAG(__HANDLE__, __FLAG__)       WRITE_REG((__HANDLE__)->Instance->SR , __FLAG__)

/** @brief  Enable the specified UART interrupt.
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  * @param  __INTERRUPT__ specifies the UART interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg UART_IT_BUSY_ERR: BUSYERR status interrupt
  *            @arg UART_IT_LS      : Receiver line status interrupt
  *            @arg UART_IT_TDRE    : Transfer Hold Register empty interrupt
  *            @arg UART_IT_RXNE    : Receive data available interrupt
  * @retval None
  */
#define __HAL_UART_ENABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->CR2 |= (__INTERRUPT__))

/** @brief  Disable the specified UART interrupt.
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  * @param  __INTERRUPT__ specifies the UART interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg UART_IT_BUSY_ERR: BUSYERR status interrupt
  *            @arg UART_IT_LS      : Receiver line status interrupt
  *            @arg UART_IT_TDRE    : Transfer Hold Register empty interrupt
  *            @arg UART_IT_RXNE    : Receive data available interrupt
  * @retval None
  */
#define __HAL_UART_DISABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->CR2 &= ~(__INTERRUPT__))

